# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

* 1) columns, index and values properties
* 2) Usefull methods
    - 1. unique
    - 2. value_counts
    - 3. sort_values
    - 4. statistics
    - 5. aggregate
    - 6. head, tail, info, describe
* 3) Apply function

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'col1':[1,5,3,2,4],'col2':[444,222,666,444,555],'col3':['abc','xyz','ijklmn','xyz', 'defgh'], 
                  'col4':['C','B','A','B', 'A']})
df

   col1  col2    col3 col4
0     1   444     abc    C
1     5   222     xyz    B
2     3   666  ijklmn    A
3     2   444     xyz    B
4     4   555   defgh    A

## 1) columns, index and values properties

In [3]:
df.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [5]:
df.columns = ['col1' , 'col2', 'col3', 'col4']
df

   col1  col2    col3 col4
0     1   444     abc    C
1     5   222     xyz    B
2     3   666  ijklmn    A
3     2   444     xyz    B
4     4   555   defgh    A

In [5]:
df.rename(columns={'col1' : 'x', 'col2' : 'y'}, inplace=True)
df

   x    y    col3 col4
0  1  444     abc    C
1  5  222     xyz    B
2  3  666  ijklmn    A
3  2  444     xyz    B
4  4  555   defgh    A

In [6]:
df.rename(columns={'x' : 'col1', 'y' : 'col2'}, inplace=True)
df

   col1  col2    col3 col4
0     1   444     abc    C
1     5   222     xyz    B
2     3   666  ijklmn    A
3     2   444     xyz    B
4     4   555   defgh    A

In [7]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
df.values

array([[1, 444, 'abc', 'C'],
       [5, 222, 'xyz', 'B'],
       [3, 666, 'ijklmn', 'A'],
       [2, 444, 'xyz', 'B'],
       [4, 555, 'defgh', 'A']], dtype=object)

##  2) Usefull methods

In [8]:
df

   col1  col2    col3 col4
0     1   444     abc    C
1     5   222     xyz    B
2     3   666  ijklmn    A
3     2   444     xyz    B
4     4   555   defgh    A

### 1. unique

In [10]:
df['col4'].unique()

array(['C', 'B', 'A'], dtype=object)

In [11]:
list(df['col4'].unique())

['C', 'B', 'A']

In [12]:
df['col4'].nunique()

3

In [13]:
df['col1'].nunique()

5

### 2. values_count

In [14]:
df

   col1  col2    col3 col4
0     1   444     abc    C
1     5   222     xyz    B
2     3   666  ijklmn    A
3     2   444     xyz    B
4     4   555   defgh    A

In [15]:
df['col4'].value_counts()

B    2
A    2
C    1
Name: col4, dtype: int64

In [16]:
df['col3'].value_counts()

xyz       2
abc       1
defgh     1
ijklmn    1
Name: col3, dtype: int64

### 3. sort_values

In [17]:
df

   col1  col2    col3 col4
0     1   444     abc    C
1     5   222     xyz    B
2     3   666  ijklmn    A
3     2   444     xyz    B
4     4   555   defgh    A

In [9]:
df.sort_values(by='col2') # inplace=False by default

   col1  col2    col3 col4
1     5   222     xyz    B
0     1   444     abc    C
3     2   444     xyz    B
4     4   555   defgh    A
2     3   666  ijklmn    A

In [10]:
df

   col1  col2    col3 col4
0     1   444     abc    C
1     5   222     xyz    B
2     3   666  ijklmn    A
3     2   444     xyz    B
4     4   555   defgh    A

In [11]:
df.sort_values(by='col2', ascending=False, inplace = True) # inplace=False by default

In [12]:
df

   col1  col2    col3 col4
2     3   666  ijklmn    A
4     4   555   defgh    A
0     1   444     abc    C
3     2   444     xyz    B
1     5   222     xyz    B

In [22]:
df.sort_values(by='col3') # inplace=False by default

   col1  col2    col3 col4
0     1   444     abc    C
4     4   555   defgh    A
2     3   666  ijklmn    A
3     2   444     xyz    B
1     5   222     xyz    B

In [23]:
df1 = df.sort_values(by='col3', ascending=False) # inplace=False by default

In [24]:
df1

   col1  col2    col3 col4
3     2   444     xyz    B
1     5   222     xyz    B
2     3   666  ijklmn    A
4     4   555   defgh    A
0     1   444     abc    C

In [25]:
df

   col1  col2    col3 col4
2     3   666  ijklmn    A
4     4   555   defgh    A
0     1   444     abc    C
3     2   444     xyz    B
1     5   222     xyz    B

In [26]:
df.sort_values(by='col2', ascending=False, inplace=True)

In [27]:
df

   col1  col2    col3 col4
2     3   666  ijklmn    A
4     4   555   defgh    A
0     1   444     abc    C
3     2   444     xyz    B
1     5   222     xyz    B

### 4. statistics

**mean**

In [28]:
df.mean()

col1      3.0
col2    466.2
dtype: float64

In [29]:
df.mean(axis=1)

2    334.5
4    279.5
0    222.5
3    223.0
1    113.5
dtype: float64

In [30]:
df['col2'].mean()

466.2

**median**

In [31]:
df.median()

col1      3.0
col2    444.0
dtype: float64

In [32]:
df['col2'].median()

444.0

**mode**

In [33]:
df.mode()

   col1   col2 col3 col4
0     1  444.0  xyz    A
1     2    NaN  NaN    B
2     3    NaN  NaN  NaN
3     4    NaN  NaN  NaN
4     5    NaN  NaN  NaN

In [14]:
# df['col3'].mode()[0]
df['col3'].mode()

0    xyz
dtype: object

**standard deviation**

In [35]:
df.std()

col1      1.581139
col2    164.639606
dtype: float64

In [36]:
df['col1'].std()

1.5811388300841898

In [37]:
df['col2'].std()

164.63960641352372

**quantile**

In [38]:
Q1 = df.quantile(0.25)
Q1

col1      2.0
col2    444.0
Name: 0.25, dtype: float64

In [39]:
q1 = df['col1'].quantile(0.25)
q1

2.0

In [40]:
Q3 = df['col1'].quantile(0.75)
Q3

4.0

In [41]:
iqr = Q3 - q1
iqr

2.0

## Min and Max

In [42]:
col1_min = df['col1'].min()
col1_min

1

In [43]:
col1_max = df['col1'].max()
col1_max

5

**correlation**

In [44]:
df.corr()

          col1      col2
col1  1.000000 -0.319801
col2 -0.319801  1.000000

### 5. aggregate

**max**

In [45]:
df.max()

col1      5
col2    666
col3    xyz
col4      C
dtype: object

In [46]:
df.max(axis=1)

2    666
4    555
0    444
3    444
1    222
dtype: int64

**min**

In [47]:
df.min()

col1      1
col2    222
col3    abc
col4      A
dtype: object

In [48]:
df.min(axis=1)

2    3
4    4
0    1
3    2
1    5
dtype: int64

In [49]:
df

   col1  col2    col3 col4
2     3   666  ijklmn    A
4     4   555   defgh    A
0     1   444     abc    C
3     2   444     xyz    B
1     5   222     xyz    B

**sum**

In [50]:
df.sum()

col1                      15
col2                    2331
col3    ijklmndefghabcxyzxyz
col4                   AACBB
dtype: object

In [51]:
df.sum(axis=1)

2    669
4    559
0    445
3    446
1    227
dtype: int64

In [52]:
df['col1'].sum()

15

**count**

In [53]:
df.count()

col1    5
col2    5
col3    5
col4    5
dtype: int64

In [54]:
df.count(axis=1)

2    4
4    4
0    4
3    4
1    4
dtype: int64

### 6. head, tail, info, describe

In [15]:
df = pd.DataFrame({'col1':[1,2,3,np.nan, 4, 5, 6],
                   'col2':[np.nan,555,666,444, 4, 5, 6],
                   'col3':['abc','def','ghi','xyz', 4, 5, 6],
                   'col4':['abc','def','ghi','xyz', 4, 5, 6],
                   'col5':['abc','def','ghi','xyz', 4, 5, 6]})
df

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4
5   5.0    5.0    5    5    5
6   6.0    6.0    6    6    6

In [16]:
df.head()

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4

In [57]:
df.head(2)

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def

In [58]:
df.tail()

   col1   col2 col3 col4 col5
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4
5   5.0    5.0    5    5    5
6   6.0    6.0    6    6    6

In [59]:
df.tail(2)

   col1  col2 col3 col4 col5
5   5.0   5.0    5    5    5
6   6.0   6.0    6    6    6

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    6 non-null      float64
 1   col2    6 non-null      float64
 2   col3    7 non-null      object
 3   col4    7 non-null      object
 4   col5    7 non-null      object
dtypes: float64(2), object(3)
memory usage: 408.0+ bytes

In [61]:
df.describe()

           col1        col2
count  6.000000    6.000000
mean   3.500000  280.000000
std    1.870829  309.319899
min    1.000000    4.000000
25%    2.250000    5.250000
50%    3.500000  225.000000
75%    4.750000  527.250000
max    6.000000  666.000000

In [62]:
df.describe(include = 'O')

       col3 col4 col5
count     7    7    7
unique    7    7    7
top     xyz  xyz  xyz
freq      1    1    1

## 3) Apply Functions

**1. apply a function to return a new column**

In [26]:
df = pd.DataFrame({'col1':[1,5,3,2,4],'col2':[444,222,666,444,555],'col3':['abc','xyz','ijklmn','xyz', 'defgh']})
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [27]:
df['radius'] = df['col1'] + 20
df

   col1  col2    col3  radius
0     1   444     abc      21
1     5   222     xyz      25
2     3   666  ijklmn      23
3     2   444     xyz      22
4     4   555   defgh      24

In [66]:
def area_of_circle(r):
    return 3.14 * (r ** 2)

In [67]:
df['radius'].apply(area_of_circle)

0    1384.74
1    1962.50
2    1661.06
3    1519.76
4    1808.64
Name: radius, dtype: float64

In [68]:
df['area'] = df['radius'].apply(area_of_circle)
df

   col1  col2    col3  radius     area
0     1   444     abc      21  1384.74
1     5   222     xyz      25  1962.50
2     3   666  ijklmn      23  1661.06
3     2   444     xyz      22  1519.76
4     4   555   defgh      24  1808.64

In [69]:
df

   col1  col2    col3  radius     area
0     1   444     abc      21  1384.74
1     5   222     xyz      25  1962.50
2     3   666  ijklmn      23  1661.06
3     2   444     xyz      22  1519.76
4     4   555   defgh      24  1808.64

In [70]:
def is_3_char(word) :
    if len(word) == 3 :
        return 1
    else :
        return 0

df['new_col'] = df['col3'].apply(is_3_char) 
df

   col1  col2    col3  radius     area  new_col
0     1   444     abc      21  1384.74        1
1     5   222     xyz      25  1962.50        1
2     3   666  ijklmn      23  1661.06        0
3     2   444     xyz      22  1519.76        1
4     4   555   defgh      24  1808.64        0

In [71]:
df['area_lambda'] = df['radius'].apply(lambda r: 3.14 * (r ** 2))
df

   col1  col2    col3  radius     area  new_col  area_lambda
0     1   444     abc      21  1384.74        1      1384.74
1     5   222     xyz      25  1962.50        1      1962.50
2     3   666  ijklmn      23  1661.06        0      1661.06
3     2   444     xyz      22  1519.76        1      1519.76
4     4   555   defgh      24  1808.64        0      1808.64

In [73]:
# df['col2'].apply(lambda x: x ** 2)

In [74]:
df

   col1  col2    col3  radius     area  new_col  area_lambda
0     1   444     abc      21  1384.74        1      1384.74
1     5   222     xyz      25  1962.50        1      1962.50
2     3   666  ijklmn      23  1661.06        0      1661.06
3     2   444     xyz      22  1519.76        1      1519.76
4     4   555   defgh      24  1808.64        0      1808.64

In [79]:
df['col3'].apply(lambda x: x * 2)

0          abcabc
1          xyzxyz
2    ijklmnijklmn
3          xyzxyz
4      defghdefgh
Name: col3, dtype: object

In [81]:
df['col3'].apply(len)

0    3
1    3
2    6
3    3
4    5
Name: col3, dtype: int64

**2. apply a function to return multi columns**

In [ ]:
df

In [82]:
def make_multi_columns(value):
    return pd.Series((value + 50, value - 100))

In [83]:
df[['Col_New_1', 'Col_New_2']] = df['radius'].apply(make_multi_columns)

In [84]:
df

,col1,col2,col3,radius,area,new_col,area_lambda,Col_New_1,Col_New_2
0,1,444,abc,21,1384.74,1,1384.74,71,-79
1,5,222,xyz,25,1962.50,1,1962.50,75,-75
2,3,666,ijklmn,23,1661.06,0,1661.06,73,-77
3,2,444,xyz,22,1519.76,1,1519.76,72,-78
4,4,555,defgh,24,1808.64,0,1808.64,74,-76

In [87]:
def calculate_equation(value) :
    col1_new = value * 2 + 3
    col2_new = value * 5 - 10
    
    return pd.Series((col1_new, col2_new))

In [88]:
df[['c1', 'c2']] = df['col1'].apply(calculate_equation)
df

,col1,col2,col3,radius,area,new_col,area_lambda,Col_New_1,Col_New_2,c1,c2
0,1,444,abc,21,1384.74,1,1384.74,71,-79,5,-5
1,5,222,xyz,25,1962.50,1,1962.50,75,-75,13,15
2,3,666,ijklmn,23,1661.06,0,1661.06,73,-77,9,5
3,2,444,xyz,22,1519.76,1,1519.76,72,-78,7,0
4,4,555,defgh,24,1808.64,0,1808.64,74,-76,11,10

In [89]:
df

,col1,col2,col3,radius,area,new_col,area_lambda,Col_New_1,Col_New_2,c1,c2
0,1,444,abc,21,1384.74,1,1384.74,71,-79,5,-5
1,5,222,xyz,25,1962.50,1,1962.50,75,-75,13,15
2,3,666,ijklmn,23,1661.06,0,1661.06,73,-77,9,5
3,2,444,xyz,22,1519.76,1,1519.76,72,-78,7,0
4,4,555,defgh,24,1808.64,0,1808.64,74,-76,11,10

**3. apply a function on many columns and return multi columns**

In [92]:
def apply_multi_columns_make_multi_columns(x) :
    if x['radius'] > 21 :
        area = x['area'] / 21
    else :
        area = x['area'] / 12
    return area

In [93]:
df['Col_New_3'] = df.apply(apply_multi_columns_make_multi_columns, axis=1)
df

,col1,col2,col3,radius,area,new_col,area_lambda,Col_New_1,Col_New_2,c1,c2,Col_New_3
0,1,444,abc,21,1384.74,1,1384.74,71,-79,5,-5,115.395000
1,5,222,xyz,25,1962.50,1,1962.50,75,-75,13,15,93.452381
2,3,666,ijklmn,23,1661.06,0,1661.06,73,-77,9,5,79.098095
3,2,444,xyz,22,1519.76,1,1519.76,72,-78,7,0,72.369524
4,4,555,defgh,24,1808.64,0,1808.64,74,-76,11,10,86.125714

In [94]:
def apply_multi_columns_make_multi_columns(x):
    return pd.Series(( (x['area'] / x['radius']), (x['radius'] + x['area'])))

In [95]:
df[['Col_New_3', 'Col_New_4']] = df.apply(apply_multi_columns_make_multi_columns, axis=1)

In [96]:
df

,col1,col2,col3,radius,area,new_col,area_lambda,Col_New_1,Col_New_2,c1,c2,Col_New_3,Col_New_4
0,1,444,abc,21,1384.74,1,1384.74,71,-79,5,-5,65.94,1405.74
1,5,222,xyz,25,1962.50,1,1962.50,75,-75,13,15,78.50,1987.50
2,3,666,ijklmn,23,1661.06,0,1661.06,73,-77,9,5,72.22,1684.06
3,2,444,xyz,22,1519.76,1,1519.76,72,-78,7,0,69.08,1541.76
4,4,555,defgh,24,1808.64,0,1808.64,74,-76,11,10,75.36,1832.64

# Great Job!